Formal-Grammar/notes.org
* Backus-Naur Form

Backus-Naur Form (BNF) specifications are used to describe what are
called *context-free grammars*.  Context-free grammars form a class of
formal grammars which are sufficiently expressive to capture the
grammars of most programming languages.  We will be using BNF
specifications to describe the rules which determine well-formed
programs in programming languages we aim to interpret.

First, a toy example/thought experiment.  Consider the following
English statement.

#+begin_src sentence
  the cow jumped over the moon
#+end_src

Suppose we tried to break down the cognitive process of determining
that this sentence is grammatical.  We might first recognize that each
word falls into a particular part of speech.  We can represent this
step of the process by replacing each word in the sentence with a
symbol /standing for/ each figure of speech (the choice of symbol
being influenced by what is to come).

#+begin_src sentence
  <article> <noun> <verb> <prep> <article> <noun>
#+end_src

We then might recognize some familiar patterns: ~<article> <noun>~
captures the determination or quantification of an object, so we might
mentally group these symbols (into what grammaticists call *nominal
phrases* or *noun phrases*) and represent them by a new symbol:

#+begin_src sentence
  <noun-phrase> <verb> <prep> <noun-phrase>
#+end_src

Then we might recognize that a preposition followed by a noun phrase
is also single unit ("over the moon", "through the woods", and "behind
the wall" are examples of *prepositional phrases*) so that the
structure of the entire sentence may be represented as

#+begin_src sentence
  <noun-phrase> <verb> <prep-phrase>
#+end_src

Then we might recognize that prepositional phrases can modify verbs,
again creating a single unit (e.g., "ran to the car", "arose from
bed") leaving us with something like

#+begin_src sentence
  <noun-phrase> <verb-phrase>
#+end_src

which we should finally recognize the canonical structure of a
well-formed sentence: /a thing does a thing./ A bit hand-wavy, but
this accounts roughly for what we do when we judge that the above
sentence is grammatical.

Putting these steps in reverse order (and starting with a single
symbol ~<sentence>~) we get something that looks like a /proof/ that
~the cow jumped over the moon~ is a grammatical sentence.


#+begin_src deriv
  <sentence>
  <noun phrase>    <verb phrase>
  <noun phrase>    <verb> <prep phrase>
  <noun phrase>    <verb> <prep> <noun phrase>
  <article> <noun> <verb> <prep> <article> <noun>
  the       cow    jumped over   the       moon
#+end_src

That is, a representation of our congnitive process.  And if we
squint, we can see something that hierarchical, something that looks a
bit like the parse tree in the introduction to this chapter.

#+begin_src tree
  S
  ├───────┐
  NP      VP
  ├───┐   ├──────┐
  A   N   V      PP
  │   │   │      ├────┐
  │   │   │      P    NP
  │   │   │      │    ├───┐
  │   │   │      │    A   N
  │   │   │      │    │   │
  the cow jumped over the moon
#+end_src

A *formal grammar* is meant to model this cognitive process of
classifying a sentence as grammatical by verifying that it has the
"right" hierarchical structure.

