Formal-Grammar/notes.html

<div id="outline-container-org5b43dca" class="outline-2">
<h2 id="org5b43dca">Backus-Naur Form</h2>
<div class="outline-text-2" id="text-org5b43dca">
<p>
Backus-Naur Form (BNF) specifications are used to describe what are
called <b>context-free grammars</b>.  Context-free grammars form a class of
formal grammars which are sufficiently expressive to capture the
grammars of most programming languages.  We will be using BNF
specifications to describe the rules which determine well-formed
programs in programming languages we aim to interpret.
</p>

<p>
First, a toy example/thought experiment.  Consider the following
English statement.
</p>

<div class="org-src-container">
<pre class="src src-sentence">the cow jumped over the moon
</pre>
</div>

<p>
Suppose we tried to break down the cognitive process of determining
that this sentence is grammatical.  We might first recognize that each
word falls into a particular part of speech.  We can represent this
step of the process by replacing each word in the sentence with a
symbol <i>standing for</i> each figure of speech (the choice of symbol
being influenced by what is to come).
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt; &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
</pre>
</div>

<p>
We then might recognize some familiar patterns: <code>&lt;article&gt; &lt;noun&gt;</code>
captures the determination or quantification of an object, so we might
mentally group these symbols (into what grammaticists call <b>nominal
phrases</b> or <b>noun phrases</b>) and represent them by a new symbol:
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">noun-phrase</span>&gt; &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">noun-phrase</span>&gt;
</pre>
</div>

<p>
Then we might recognize that a preposition followed by a noun phrase
is also single unit ("over the moon", "through the woods", and "behind
the wall" are examples of <b>prepositional phrases</b>) so that the
structure of the entire sentence may be represented as
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">noun-phrase</span>&gt; &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep-phrase</span>&gt;
</pre>
</div>

<p>
Then we might recognize that prepositional phrases can modify verbs,
again creating a single unit (e.g., "ran to the car", "arose from
bed") leaving us with something like
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">noun-phrase</span>&gt; &lt;<span style="color: #483d8b;">verb-phrase</span>&gt;
</pre>
</div>

<p>
which we should finally recognize the canonical structure of a
well-formed sentence: <i>a thing does a thing.</i> A bit hand-wavy, but
this accounts roughly for what we do when we judge that the above
sentence is grammatical.
</p>

<p>
Putting these steps in reverse order (and starting with a single
symbol <code>&lt;sentence&gt;</code>) we get something that looks like a <i>proof</i> that
<code>the cow jumped over the moon</code> is a grammatical sentence.
</p>


<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">sentence</span>&gt;
&lt;<span style="color: #483d8b;">noun phrase</span>&gt;    &lt;<span style="color: #483d8b;">verb phrase</span>&gt;
&lt;<span style="color: #483d8b;">noun phrase</span>&gt;    &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep phrase</span>&gt;
&lt;<span style="color: #483d8b;">noun phrase</span>&gt;    &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">noun phrase</span>&gt;
&lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt; &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
the       cow    jumped over   the       moon
</pre>
</div>

<p>
That is, a representation of our congnitive process.  And if we
squint, we can see something that hierarchical, something that looks a
bit like the parse tree in the introduction to this chapter.
</p>

<div class="org-src-container">
<pre class="src src-tree">S
├───────┐
NP      VP
├───┐   ├──────┐
A   N   V      PP
│   │   │      ├────┐
│   │   │      P    NP
│   │   │      │    ├───┐
│   │   │      │    A   N
│   │   │      │    │   │
the cow jumped over the moon
</pre>
</div>

<p>
A <b>formal grammar</b> is meant to model this cognitive process of
classifying a sentence as grammatical by verifying that it has the
"right" hierarchical structure.
</p>
</div>
