Formal-Grammar/notes.org
** Definitions

When defining a formal grammar, we fix ourselves to a collection of
symbols.  These symbols are divided into two disjoint groups: the
*terminal symbols* and the *non-terminal symbols*.  We will always
notate a non-terminal symbol by something of the form ~<non-term>~
(where we replace ~non-term~ with something more descriptive) and
terminal symbols by sequence of (typically) alphanumeric symbols.

#+begin_quote
*Remark.* We almost never state outright what the underlying symbols
of a grammar are.  It should always be possible to determine what
terminal and non-terminal symbols we are considering by looking at the
BNF specification itself.
#+end_quote

In the proof that ~the cow jumped over the moon~ was grammatical, we
built a sequence of not-quite sentences, until the very last one which
was an actual sentences. We call these not-quite sentences *sentential
forms*.

#+begin_quote
*Definition.* A *sentential form* is a sequence of symbols (terminal
or non-terminal).  A **sentence** is a sequence of terminal symbols.
#+end_quote

#+begin_quote
*Remark.* We notate a sequences of symbols by white space separation.
For example,

#+begin_src sent
the dog jumped
#+end_src

is a sentence and

#+begin_src sent
the <noun> jumped
#+end_src

is a sentential form.  But it is important to note that /this is just
notation/.  If it helps, it may be useful to imagine a /list/

#+begin_src sent
[the; <noun>; jumped]
#+end_src

when thinking about what a sentential form is.
#+end_quote

In the process of building sentential forms, we replaced non-terminal
symbols with sentential forms, e.g., we replaced ~<noun phrase>~ with
~<article> <noun>~.  A grammar is determined by what replacements we
are allowed to do.

#+begin_quote
*Definition.* A *production rule* is an equation of the form

#+begin_src prod
<non-term> ::= SENTENTIAL-FORM
#+end_src

where the left-hand side of the ~::=~ is a non-terminal symbol, and
the right-hand side is a sentential form.
#+end_quote

We read a production rule as: "the non-terminal symbol on the
left-hand side can be replaced with the sentential form on the right
hand side."  In a sense, production rules /define/ the non-terminal
symbols, e.g., a sentence is a noun phrase followed by a verb phrase.

#+begin_quote
*Definition.* A *Backus-Naur Form (BNF) specification* is a collection
of production rules, together with a designated the *starting symbol*.
#+end_quote


We will always take the start symbol will be designated as the
left-hand side of the *first* rule appearing in a specification.

#+begin_quote
*Example.* The following is an example of a grammar which /recognizes/
the sentence above.

#+begin_src bnf
<sentence>    ::= <noun-phrase> <verb-phrase>
<verb-phrase> ::= <verb> <prep-phrase>
<verb-phrase> ::= <verb>
<prep-phrase> ::= <prep> <noun-phrase>
<noun-phrase> ::= <article> <noun>
<article>     ::= the
<noun>        ::= cow
<noun>        ::= moon
<verb>        ::= jumped
<prep>        ::= over
#+end_src

The nonterminal symbol ~<sentence>~ is our starting symbol because it
appears as the left-hand side of the first rule.
#+end_quote

Note that a non-terminal symbol can have multiple associated
production rules.  This is common enough that we have special syntax
for this.

#+begin_quote
*Notation.* We write

#+begin_src bnf
<non-term> ::= SENT-FORM-1 | SENT-FORM-2 | ... | SENT-FORM-n
#+end_src

as shorthand for

#+begin_src bnf
<non-term> ::= SENT-FORM-1
<non-term> ::= SENT-FORM-2
...
<non-term> ::= SENT-FORM-n
#+end_src

#+end_quote

With this shorthand, we can write the above grammar as:

#+begin_src bnf
<sentence>    ::= <noun-phrase> <verb-phrase>
<verb-phrase> ::= <verb> | <verb> <prep-phrase>
<prep-phrase> ::= <prep> <noun-phrase>
<noun-phrase> ::= <article> <noun>
<article>     ::= the
<noun>        ::= cow | moon
<verb>        ::= jumped
<prep>        ::= over
#+end_src

The last piece of the thought experiment above that we need to
formalize is the /proof/ that the given sentence was grammatical.  We
formalize this in the notion of a *derivation*.

#+begin_quote
*Definition.* A *derivation* of a sentence ~S~ in a BNF grammar is a
sequence of sentential forms with the following properties:

+ it beginning with the designated start symbol;
+ it ends in the sentence ~S~;
+ each sentential form is a the result of replacing /one of/ the
  non-terminal symbols in the preceding sentence with a sentential
  form according to a production rule of the grammar.

We say that a grammar *recognizes* a sentence ~S~ if there is a
derivation of ~S~ in the grammar.
#+end_quote

This definition restates the process from the thought experiment
mathematically.  That said, it deviates in one way which makes the
definition easier to state: in the thought experiment, we allowed
ourselves to replace multiple non-terminal symbols simultaneously.
This is not allowed in the above notion of a derivation. A /correct/
derivation would look like:

#+begin_src deriv
<sentence>
<noun-phrase>    <verb-phrase>
<noun-phrase>    <verb> <prep-phrase>
<noun-phrase>    <verb> <prep> <noun-phrase>
<article> <noun> <verb> <prep> <noun-phrase>
<article> <noun> <verb> <prep> <article> <noun>
the       <noun> <verb> <prep> <article> <noun>
the       cow    <verb> <prep> <article> <noun>
the       cow    jumped <prep> <article> <noun>
the       cow    jumped over   <article> <noun>
the       cow    jumped over   the       <noun>
the       cow    jumped over   the       moon
#+end_src

#+begin_quote
*Exercise.* In the above derivation, mark the nonterminal in each
sentential form which was replaced in the following line.
#+end_quote

A sentence is not guaranteed to have a /unique/ derivation.  There are
two forms of derivations that will be of particular importance for us.

#+begin_quote
*Definition.* A *leftmost derivation* of a sentence is one in which
the leftmost nonterminal symbol is expanded in each step.  A
*rightmost derivation* is one in which the rightmost nonterminal
symbol is expanded in each step.
#+end_quote


Note that the above derivation is neither the leftmost derivation or
the rightmost derivation.

#+begin_quote
*Exercise.* Write leftmost and rightmost derivations for the sentence

#+begin_src sent
the cow jumped over the moon
#+end_src

in the above grammar.
#+end_quote

