Formal-Grammar/notes.html

<div id="outline-container-orgb464740" class="outline-3">
<h3 id="orgb464740">Definitions</h3>
<div class="outline-text-3" id="text-orgb464740">
<p>
When defining a formal grammar, we fix ourselves to a collection of
symbols.  These symbols are divided into two disjoint groups: the
<b>terminal symbols</b> and the <b>non-terminal symbols</b>.  We will always
notate a non-terminal symbol by something of the form <code>&lt;non-term&gt;</code>
(where we replace <code>non-term</code> with something more descriptive) and
terminal symbols by sequence of (typically) alphanumeric symbols.
</p>

<blockquote>
<p>
<b>Remark.</b> We almost never state outright what the underlying symbols
of a grammar are.  It should always be possible to determine what
terminal and non-terminal symbols we are considering by looking at the
BNF specification itself.
</p>
</blockquote>

<p>
In the proof that <code>the cow jumped over the moon</code> was grammatical, we
built a sequence of not-quite sentences, until the very last one which
was an actual sentences. We call these not-quite sentences <b>sentential
forms</b>.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>sentential form</b> is a sequence of symbols (terminal
or non-terminal).  A <b><b>sentence</b></b> is a sequence of terminal symbols.
</p>
</blockquote>

<blockquote>
<p>
<b>Remark.</b> We notate a sequences of symbols by white space separation.
For example,
</p>

<div class="org-src-container">
<pre class="src src-sent">the dog jumped
</pre>
</div>

<p>
is a sentence and
</p>

<div class="org-src-container">
<pre class="src src-bnf">the &lt;<span style="color: #483d8b;">noun</span>&gt; jumped
</pre>
</div>

<p>
is a sentential form.  But it is important to note that <i>this is just
notation</i>.  If it helps, it may be useful to imagine a <i>list</i>
</p>

<div class="org-src-container">
<pre class="src src-sent">[the; &lt;noun&gt;; jumped]
</pre>
</div>

<p>
when thinking about what a sentential form is.
</p>
</blockquote>

<p>
In the process of building sentential forms, we replaced non-terminal
symbols with sentential forms, e.g., we replaced <code>&lt;noun phrase&gt;</code> with
<code>&lt;article&gt; &lt;noun&gt;</code>.  A grammar is determined by what replacements we
are allowed to do.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>production rule</b> is an equation of the form
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">non-term</span>&gt; <span style="color: #008b8b;">::=</span> SENTENTIAL-FORM
</pre>
</div>

<p>
where the left-hand side of the <code>::=</code> is a non-terminal symbol, and
the right-hand side is a sentential form.
</p>
</blockquote>

<p>
We read a production rule as: "the non-terminal symbol on the
left-hand side can be replaced with the sentential form on the right
hand side."  In a sense, production rules <i>define</i> the non-terminal
symbols, e.g., a sentence is a noun phrase followed by a verb phrase.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>Backus-Naur Form (BNF) specification</b> is a collection
of production rules, together with a designated the <b>starting symbol</b>.
</p>
</blockquote>


<p>
We will always take the start symbol will be designated as the
left-hand side of the <b>first</b> rule appearing in a specification.
</p>

<blockquote>
<p>
<b>Example.</b> The following is an example of a grammar which <i>recognizes</i>
the sentence above.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">sentence</span>&gt;    <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">noun-phrase</span>&gt; &lt;<span style="color: #483d8b;">verb-phrase</span>&gt;
&lt;<span style="color: #0000ff;">verb-phrase</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep-phrase</span>&gt;
&lt;<span style="color: #0000ff;">verb-phrase</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">verb</span>&gt;
&lt;<span style="color: #0000ff;">prep-phrase</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">noun-phrase</span>&gt;
&lt;<span style="color: #0000ff;">noun-phrase</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
&lt;<span style="color: #0000ff;">article</span>&gt;     <span style="color: #008b8b;">::=</span> the
&lt;<span style="color: #0000ff;">noun</span>&gt;        <span style="color: #008b8b;">::=</span> cow
&lt;<span style="color: #0000ff;">noun</span>&gt;        <span style="color: #008b8b;">::=</span> moon
&lt;<span style="color: #0000ff;">verb</span>&gt;        <span style="color: #008b8b;">::=</span> jumped
&lt;<span style="color: #0000ff;">prep</span>&gt;        <span style="color: #008b8b;">::=</span> over
</pre>
</div>

<p>
The nonterminal symbol <code>&lt;sentence&gt;</code> is our starting symbol because it
appears as the left-hand side of the first rule.
</p>
</blockquote>

<p>
Note that a non-terminal symbol can have multiple associated
production rules.  This is common enough that we have special syntax
for this.
</p>

<blockquote>
<p>
<b>Notation.</b> We write
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">non-term</span>&gt; <span style="color: #008b8b;">::=</span> SENT-FORM-1 <span style="color: #ff0000; font-weight: bold;">|</span> SENT-FORM-2 <span style="color: #ff0000; font-weight: bold;">|</span> ... <span style="color: #ff0000; font-weight: bold;">|</span> SENT-FORM-n
</pre>
</div>

<p>
as shorthand for
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">non-term</span>&gt; <span style="color: #008b8b;">::=</span> SENT-FORM-1
&lt;<span style="color: #0000ff;">non-term</span>&gt; <span style="color: #008b8b;">::=</span> SENT-FORM-2
...
&lt;<span style="color: #0000ff;">non-term</span>&gt; <span style="color: #008b8b;">::=</span> SENT-FORM-n
</pre>
</div>
</blockquote>

<p>
With this shorthand, we can write the above grammar as:
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">sentence</span>&gt;    <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">noun-phrase</span>&gt; &lt;<span style="color: #483d8b;">verb-phrase</span>&gt;
&lt;<span style="color: #0000ff;">verb-phrase</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">verb</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep-phrase</span>&gt;
&lt;<span style="color: #0000ff;">prep-phrase</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">noun-phrase</span>&gt;
&lt;<span style="color: #0000ff;">noun-phrase</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
&lt;<span style="color: #0000ff;">article</span>&gt;     <span style="color: #008b8b;">::=</span> the
&lt;<span style="color: #0000ff;">noun</span>&gt;        <span style="color: #008b8b;">::=</span> cow <span style="color: #ff0000; font-weight: bold;">|</span> moon
&lt;<span style="color: #0000ff;">verb</span>&gt;        <span style="color: #008b8b;">::=</span> jumped
&lt;<span style="color: #0000ff;">prep</span>&gt;        <span style="color: #008b8b;">::=</span> over
</pre>
</div>

<p>
The last piece of the thought experiment above that we need to
formalize is the <i>proof</i> that the given sentence was grammatical.  We
formalize this in the notion of a <b>derivation</b>.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>derivation</b> of a sentence <code>S</code> in a BNF grammar is a
sequence of sentential forms with the following properties:
</p>

<ul class="org-ul">
<li>it beginning with the designated start symbol;</li>
<li>it ends in the sentence <code>S</code>;</li>
<li>each sentential form is a the result of replacing <i>one of</i> the
non-terminal symbols in the preceding sentence with a sentential
form according to a production rule of the grammar.</li>
</ul>

<p>
We say that a grammar <b>recognizes</b> a sentence <code>S</code> if there is a
derivation of <code>S</code> in the grammar.
</p>
</blockquote>

<p>
This definition restates the process from the thought experiment
mathematically.  That said, it deviates in one way which makes the
definition easier to state: in the thought experiment, we allowed
ourselves to replace multiple non-terminal symbols simultaneously.
This is not allowed in the above notion of a derivation. A <i>correct</i>
derivation would look like:
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">sentence</span>&gt;
&lt;<span style="color: #483d8b;">noun-phrase</span>&gt;    &lt;<span style="color: #483d8b;">verb-phrase</span>&gt;
&lt;<span style="color: #483d8b;">noun-phrase</span>&gt;    &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep-phrase</span>&gt;
&lt;<span style="color: #483d8b;">noun-phrase</span>&gt;    &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">noun-phrase</span>&gt;
&lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt; &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">noun-phrase</span>&gt;
&lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt; &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
the       &lt;<span style="color: #483d8b;">noun</span>&gt; &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
the       cow    &lt;<span style="color: #483d8b;">verb</span>&gt; &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
the       cow    jumped &lt;<span style="color: #483d8b;">prep</span>&gt; &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
the       cow    jumped over   &lt;<span style="color: #483d8b;">article</span>&gt; &lt;<span style="color: #483d8b;">noun</span>&gt;
the       cow    jumped over   the       &lt;<span style="color: #483d8b;">noun</span>&gt;
the       cow    jumped over   the       moon
</pre>
</div>

<blockquote>
<p>
<b>Exercise.</b> In the above derivation, mark the nonterminal in each
sentential form which was replaced in the following line.
</p>
</blockquote>

<p>
A sentence is not guaranteed to have a <i>unique</i> derivation.  There are
two forms of derivations that will be of particular importance for us.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>leftmost derivation</b> of a sentence is one in which
the leftmost nonterminal symbol is expanded in each step.  A
<b>rightmost derivation</b> is one in which the rightmost nonterminal
symbol is expanded in each step.
</p>
</blockquote>


<p>
Note that the above derivation is neither the leftmost derivation or
the rightmost derivation.
</p>

<blockquote>
<p>
<b>Exercise.</b> Write leftmost and rightmost derivations for the sentence
</p>

<div class="org-src-container">
<pre class="src src-sent">the cow jumped over the moon
</pre>
</div>

<p>
in the above grammar.
</p>
</blockquote>
</div>
</div>
