Formal-Grammar/notes.org
** A More Interesting Example

The following is a BNF specification for a fragment of a simple
imperative programming language.

#+begin_src bnf
<program> ::= <stmts>
<stmts>   ::= <stmt> | <stmt> ; <stmts>
<stmt>    ::= <var> = <expr>
<var>     ::= a | b | c | d
<expr>    ::= <term> | <term> + <term> | <term> - <term>
<term>    ::= <var> | const
#+end_src

In English, we would read this specification as:

+ a PROGRAM is a SEQUENCE OF STATEMENTS;
+ a SEQUENCE OF STATEMENTS is either a single STATEMENT, or a single
  STATEMENT followed a semicolon, followed by a SEQUENCE OF
  STATEMENTS;
+ a STATEMENT is a VARIABLE followed by an equals sign, followed
  by an EXPRESSION.

and so on.

This second rule highlights something interesting which we can do in
BNF specifications: rules are allowed to be /recursive/.  The
production rule for ~<stmts>~ allows us to replace it with a
sentential form which /contains/ the non-terminal symbol ~<stmts>~.
This is quite powerful, particularly because it means it is possible
to derive an infinite number of sentences in a given grammar.

#+begin_quote
*Exercise.* Determine the number of sentences that can be derived in
 the grammar from the previous section (i.e., the number of sentences
 which can be derived from the starting symbol ~<sentence>~).
#+end_quote

Consider the following program.

#+begin_src prog
a = const ;
a = a + const ;
b = a
#+end_src

We can verify that this program is recognized by the above grammar by
finding a (leftmost) derivation.

#+begin_src deriv
<program>
<stmts>
<stmt> ; <stmts>
<var> = <expr> ; <stmts>
a = <expr> ; <stmts>
a = <term> ; <stmts>
a = const ; <stmts>
a = const ; <stmt> ; <stmts>
a = const ; <var> = <expr> ; <stmts>
a = const ; a = <expr> ; <stmts>
a = const ; a = <term> + <term> ; <stmts>
a = const ; a = <var> + <term> ; <stmts>
a = const ; a = a + <term> ; <stmts>
a = const ; a = a + const ; <stmts>
a = const ; a = a + const ; <var> = <expr>
a = const ; a = a + const ; b = <expr>
a = const ; a = a + const ; b = <term>
a = const ; a = a + const ; b = <var>
a = const ; a = a + const ; b = a
#+end_src

#+begin_quote
*Remark.* As a reminder, we're not interested in white space when we
consider whether or not a sentence is recognized by a grammar.  The
choice to present the sentences in three lines was for readability,
and the choice to present it in a single line in the derivation was
for convenience.
#+end_quote

One notable feature of the last four lines of the above derivation:
even if a nonterminal symbol is replaced by a /single/ nonterminal
symbol in succession, *we have to include each step*.  We're only
allowed to apply one production rule at a time, e.g., we cannot
immedatiely replace ~<expr>~ with ~<var>~ because that is not one of
our production rules.

#+begin_quote
*Exercise.* Write a rightmost derivation for the above program.
#+end_quote

#+begin_quote
*Exercise.* Verify that

#+begin_src prog
a = a + a ; b = b
#+end_src

is recognized by the above grammar.
#+end_quote

** Parse Trees

Grammars imbue sentences with hierarchical structure.  This structure
is represented graphically as a *parse tree*.  We've seen a couple
examples of English grammar parse trees so far, but we can also build
parse trees for sentences recognized by /any/ grammar with a BNF
specification.

#+begin_quote
*Definition.* A *parse tree* for a sentence ~S~ in a grammar is a tree
~T~ with the following properties:

+ every leaf of ~T~ has a terminal symbol;
+ every non-leaf node ~n~ has a nonterminal symbol (we write ~val(n)~
  for the value at ~n~);
+ if a node ~n~ with has children ~[t1, t2, ..., tk]~ then

  #+begin_src pseudo
    val(n) ::= root(t1) root(t2) ... root(tk)
  #+end_src

  is a production rule in the grammar (where ~root(t)~ denotes the
  value at the root of the tree ~t~);

+ the leaves (in order) (i.e., the *frontier* of ~T~) form the
  sentence ~S~.
#+end_quote

The details of the above definition are not so important, as long as
you have the right picture in your head.  For example, the sentence ~a
= b + const~ has the following derivation.

#+begin_src deriv
<program>
<stmts>
<stmt>
<var> = <expr>
a = <expr>
a = <term> + <term>
a = <var> + <term>
a = b + <term>
a = b + const
#+end_src

And has the following parse tree.

#+begin_src ascii
  <program>
  │
  <stmts>
  │
  <stmt>
  ├─────┬───┐
  <var> │   <expr>
  │     │   ├──────┬─┐
  │     │   <term> │ <term>
  │     │   │      │ │
  │     │   <var>  │ │
  │     │   │      │ │
  a     =   b      + const
#+end_src

#+begin_quote
*Remark.* You don't have to draw your trees in this rectilinear
styling. If you're drawing one on paper, I'd recommend drawing it like
any other tree you've drawn for another computer science course.  I
just have a predilection for ASCII art...
#+end_quote

#+begin_quote
*Exercise.* Given the ADT

#+begin_src ocaml
type 'a tree
   = Leaf of 'a
   | Node of 'a * 'a tree list
#+end_src

write the OCaml function ~frontier~ which, given

+ ~t~ of type ~'a tree~

returns the list of leaves of ~t~ in order from left to right.
#+end_quote

Every derivation can be converted into a parse tree, and vice versa,
but multiple derivations may correspond to the same parse tree.  This
will be important when we cover ambiguity in the next section.

#+begin_quote
*Exercise.* Write a derivation corresponding to the above parse tree
 when is neither leftmost nor rightmost.
#+end_quote

