Formal-Grammar/notes.html

<div id="outline-container-orga46734b" class="outline-3">
<h3 id="orga46734b">A More Interesting Example</h3>
<div class="outline-text-3" id="text-orga46734b">
<p>
The following is a BNF specification for a fragment of a simple
imperative programming language.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">program</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">stmts</span>&gt;
&lt;<span style="color: #0000ff;">stmts</span>&gt;   <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">stmt</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">stmt</span>&gt; <span style="color: #b22222;">; &lt;stmts&gt;</span>
&lt;<span style="color: #0000ff;">stmt</span>&gt;    <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var</span>&gt; = &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #0000ff;">var</span>&gt;     <span style="color: #008b8b;">::=</span> a <span style="color: #ff0000; font-weight: bold;">|</span> b <span style="color: #ff0000; font-weight: bold;">|</span> c <span style="color: #ff0000; font-weight: bold;">|</span> d
&lt;<span style="color: #0000ff;">expr</span>&gt;    <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">term</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">term</span>&gt; + &lt;<span style="color: #483d8b;">term</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">term</span>&gt; - &lt;<span style="color: #483d8b;">term</span>&gt;
&lt;<span style="color: #0000ff;">term</span>&gt;    <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> const
</pre>
</div>

<p>
In English, we would read this specification as:
</p>

<ul class="org-ul">
<li>a PROGRAM is a SEQUENCE OF STATEMENTS;</li>
<li>a SEQUENCE OF STATEMENTS is either a single STATEMENT, or a single
STATEMENT followed a semicolon, followed by a SEQUENCE OF
STATEMENTS;</li>
<li>a STATEMENT is a VARIABLE followed by an equals sign, followed
by an EXPRESSION.</li>
</ul>

<p>
and so on.
</p>

<p>
This second rule highlights something interesting which we can do in
BNF specifications: rules are allowed to be <i>recursive</i>.  The
production rule for <code>&lt;stmts&gt;</code> allows us to replace it with a
sentential form which <i>contains</i> the non-terminal symbol <code>&lt;stmts&gt;</code>.
This is quite powerful, particularly because it means it is possible
to derive an infinite number of sentences in a given grammar.
</p>

<blockquote>
<p>
<b>Exercise.</b> Determine the number of sentences that can be derived in
 the grammar from the previous section (i.e., the number of sentences
 which can be derived from the starting symbol <code>&lt;sentence&gt;</code>).
</p>
</blockquote>

<p>
Consider the following program.
</p>

<div class="org-src-container">
<pre class="src src-prog">a = const ;
a = a + const ;
b = a
</pre>
</div>

<p>
We can verify that this program is recognized by the above grammar by
finding a (leftmost) derivation.
</p>

<div class="org-src-container">
<pre class="src src-deriv">&lt;program&gt;
&lt;stmts&gt;
&lt;stmt&gt; ; &lt;stmts&gt;
&lt;var&gt; = &lt;expr&gt; ; &lt;stmts&gt;
a = &lt;expr&gt; ; &lt;stmts&gt;
a = &lt;term&gt; ; &lt;stmts&gt;
a = const ; &lt;stmts&gt;
a = const ; &lt;stmt&gt; ; &lt;stmts&gt;
a = const ; &lt;var&gt; = &lt;expr&gt; ; &lt;stmts&gt;
a = const ; a = &lt;expr&gt; ; &lt;stmts&gt;
a = const ; a = &lt;term&gt; + &lt;term&gt; ; &lt;stmts&gt;
a = const ; a = &lt;var&gt; + &lt;term&gt; ; &lt;stmts&gt;
a = const ; a = a + &lt;term&gt; ; &lt;stmts&gt;
a = const ; a = a + const ; &lt;stmts&gt;
a = const ; a = a + const ; &lt;var&gt; = &lt;expr&gt;
a = const ; a = a + const ; b = &lt;expr&gt;
a = const ; a = a + const ; b = &lt;term&gt;
a = const ; a = a + const ; b = &lt;var&gt;
a = const ; a = a + const ; b = a
</pre>
</div>

<blockquote>
<p>
<b>Remark.</b> As a reminder, we're not interested in white space when we
consider whether or not a sentence is recognized by a grammar.  The
choice to present the sentences in three lines was for readability,
and the choice to present it in a single line in the derivation was
for convenience.
</p>
</blockquote>

<p>
One notable feature of the last four lines of the above derivation:
even if a nonterminal symbol is replaced by a <i>single</i> nonterminal
symbol in succession, <b>we have to include each step</b>.  We're only
allowed to apply one production rule at a time, e.g., we cannot
immedatiely replace <code>&lt;expr&gt;</code> with <code>&lt;var&gt;</code> because that is not one of
our production rules.
</p>

<blockquote>
<p>
<b>Exercise.</b> Write a rightmost derivation for the above program.
</p>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> Verify that
</p>

<div class="org-src-container">
<pre class="src src-prog">a = a + a ; b = b
</pre>
</div>

<p>
is recognized by the above grammar.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org3f3d53d" class="outline-3">
<h3 id="org3f3d53d">Parse Trees</h3>
<div class="outline-text-3" id="text-org3f3d53d">
<p>
Grammars imbue sentences with hierarchical structure.  This structure
is represented graphically as a <b>parse tree</b>.  We've seen a couple
examples of English grammar parse trees so far, but we can also build
parse trees for sentences recognized by <i>any</i> grammar with a BNF
specification.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>parse tree</b> for a sentence <code>S</code> in a grammar is a tree
<code>T</code> with the following properties:
</p>

<ul class="org-ul">
<li>every leaf of <code>T</code> has a terminal symbol;</li>
<li>every non-leaf node <code>n</code> has a nonterminal symbol (we write <code>val(n)</code>
for the value at <code>n</code>);</li>
<li><p>
if a node <code>n</code> with has children <code>[t1, t2, ..., tk]</code> then
</p>

<div class="org-src-container">
<pre class="src src-pseudo">val(n) ::= root(t1) root(t2) ... root(tk)
</pre>
</div>

<p>
is a production rule in the grammar (where <code>root(t)</code> denotes the
value at the root of the tree <code>t</code>);
</p></li>

<li>the leaves (in order) (i.e., the <b>frontier</b> of <code>T</code>) form the
sentence <code>S</code>.</li>
</ul>
</blockquote>

<p>
The details of the above definition are not so important, as long as
you have the right picture in your head.  For example, the sentence <code>a
= b + const</code> has the following derivation.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">program</span>&gt;
&lt;<span style="color: #483d8b;">stmts</span>&gt;
&lt;<span style="color: #483d8b;">stmt</span>&gt;
&lt;<span style="color: #483d8b;">var</span>&gt; = &lt;<span style="color: #483d8b;">expr</span>&gt;
a = &lt;<span style="color: #483d8b;">expr</span>&gt;
a = &lt;<span style="color: #483d8b;">term</span>&gt; + &lt;<span style="color: #483d8b;">term</span>&gt;
a = &lt;<span style="color: #483d8b;">var</span>&gt; + &lt;<span style="color: #483d8b;">term</span>&gt;
a = b + &lt;<span style="color: #483d8b;">term</span>&gt;
a = b + const
</pre>
</div>

<p>
And has the following parse tree.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">program</span>&gt;
&#9474;
&lt;<span style="color: #483d8b;">stmts</span>&gt;
&#9474;
&lt;<span style="color: #483d8b;">stmt</span>&gt;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9516;&#9472;&#9472;&#9472;&#9488;
&lt;<span style="color: #483d8b;">var</span>&gt; &#9474;   &lt;<span style="color: #483d8b;">expr</span>&gt;
&#9474;     &#9474;   &#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9516;&#9472;&#9488;
&#9474;     &#9474;   &lt;<span style="color: #483d8b;">term</span>&gt; &#9474; &lt;<span style="color: #483d8b;">term</span>&gt;
&#9474;     &#9474;   &#9474;      &#9474; &#9474;
&#9474;     &#9474;   &lt;<span style="color: #483d8b;">var</span>&gt;  &#9474; &#9474;
&#9474;     &#9474;   &#9474;      &#9474; &#9474;
a     =   b      + const
</pre>
</div>

<blockquote>
<p>
<b>Remark.</b> You don't have to draw your trees in this rectilinear
styling. If you're drawing one on paper, I'd recommend drawing it like
any other tree you've drawn for another computer science course.  I
just have a predilection for ASCII art&#x2026;
</p>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> Given the ADT
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">'a tree</span>
   = <span style="color: #000000; background-color: #ffffff;">Leaf</span> <span style="color: #a020f0;">of</span> 'a
   | <span style="color: #000000; background-color: #ffffff;">Node</span> <span style="color: #a020f0;">of</span> 'a * 'a tree list
</pre>
</div>

<p>
write the OCaml function <code>frontier</code> which, given
</p>

<ul class="org-ul">
<li><code>t</code> of type <code>'a tree</code></li>
</ul>

<p>
returns the list of leaves of <code>t</code> in order from left to right.
</p>
</blockquote>

<p>
Every derivation can be converted into a parse tree, and vice versa,
but multiple derivations may correspond to the same parse tree.  This
will be important when we cover ambiguity in the next section.
</p>

<blockquote>
<p>
<b>Exercise.</b> Write a derivation corresponding to the above parse tree
 when is neither leftmost nor rightmost.
</p>
</blockquote>
</div>
</div>
</div>
