Formal-Grammar/notes.org
* Ambiguity

As participants of language, we are no strangers to grammatical
ambiguity.  Take, for instance, the following sentence:[fn::This
sentence is taken from the Wikipedia article on [[https://en.wikipedia.org/wiki/Syntactic_ambiguity][syntactic ambiguity]].]

#+begin_src sent
John saw the man on the mountain with the telescope
#+end_src

Was John using the telescope?  Was the man carrying the telescope?
Are the multiple mountains, one of which has a telescope on it?

The ambiguity exists because it is not clear /which/ hierarchical
structure should scaffold the sentence.  Here are two options for the
verb phrase in the sentence.

#+begin_src ascii
  VP
  ├───┬───────────────────────┐
  V   NP                      PP
  │   ├───────┐               │
  │   NP      PP              │
  │   │       ├──┐            ├────┐
  │   │       P  NP           P    NP
  │   ├───┐   │  ├───┐        │    ├───┐
  │   A   N   │  A   N        │    A   N
  │   │   │   │  │   │        │    │   │
  saw the man on the mountain with the telescope
#+end_src

The propositional phrase ~with the telescope~ is grouped alongside the
verb phrase starting with ~saw~, indicating that John was /using/ the
telescope.  Another option:


#+begin_src ascii
  VP
  ├───┐
  V   NP
  │   ├───────┐
  │   NP      PP
  │   ├───┐   ├──┐
  │   A   N   P  NP
  │   │   │   │  ├────────────┐
  │   │   │   │  NP           PP
  │   │   │   │  ├───┐        ├────┐
  │   │   │   │  A   N        P    NP
  │   │   │   │  │   │        │    ├───┐
  │   │   │   │  │   │        │    A   N
  │   │   │   │  │   │        │    │   │
  saw the man on the mountain with the telescope
#+end_src

The prepositional phrase ~with the telescope~ is part of the noun
phrase with ~the mountain~, indicating the there is a telescope on the
mountain and the man is climbing that mountain.

The ambiguity comes from not being completely sure which parse tree to
give to the sentence; we experience language in a /linear fashion/,
either by reading it or hearing it.  If our interlocutor could
/display/ the parse tree of their statement (floating eerily in space
before your eyes) there would be nothing to say of (grammatical)
ambiguity.

But this is /not/ how we experience language, or how we write
programs for that matter.  To drive the point home, there is a
natural-enough looking grammar which recognizes the above sentence.

#+begin_src bnf
<s>  ::= <np> <vp>
<vp> ::= <v> | <v> <np> | <v> <np> <pp>
<pp> ::= <p> <np>
<np> ::= <n> | <d> <n> | <np> <pp>
<n>  ::= John | man | mountain | telescope
<v>  ::= saw
<d>  ::= the
<p>  ::= on | with
#+end_src

The above sentence has multiple parse trees in the above
grammar. Equivalently, since parse trees correspond to exactly one
leftmost derivation (you should try to convince yourself of this), it
also has multiple leftmost derivations.

#+begin_quote
*Exercise.* Give two leftmost derivations of

#+begin_src sent
John saw the man on the mountain with the telescope
#+end_src

in the above grammar.
#+end_quote

Ambiguity in natural language is a complex topic, but restricted to
formal grammars, ambiguity is a well-defined notion.

#+begin_quote
*Definition.* A grammar is *ambiguous* there is a sentence it
recognizes which has two distinct parse trees.  Equivalently, it is
ambiguous of there is a sentence it recognizes which has two distinct
leftmost derivations.
#+end_quote

Thus, the above grammar is ambiguous in the mathematical sense.

More to the point, consider the following grammar which may be seen as
a prototype of a grammar for arithmetic expressions (something we will
probably want if we're to give a grammar for a programming language).

#+begin_src bnf
<expr> ::= <var> | <expr> <op> <expr>
<op>   ::= + | - | * | /
<var>  ::= x
#+end_src

This seems, ignoring obvious issues, a reasonable enough definition;
/an expression is either a variable or a pair of expressions with an
operator between them/.  Note that the recursive nature of the first
production rule means that this grammar recognizes an infinite number
of sentence.

#+begin_quote
*Exercise.* Give a leftmost a derivation of ~x * x + x * x~ in the above grammar.
#+end_quote

But, with regards to ambiguity, we should already be suspicious of the
first production rule.  As soon as we've applied the (second
alternative of) the first production rule twice we have the partial derivation:

#+begin_src bnf
<expr>
<expr> <op> <expr>
<expr> <op> <expr> <op> <expr>
#+end_src

For the third line, /which of the two ~<expr>~ symbols did we expand?/
To make this concrete, here are two parse trees for the sentence ~x +
x + x~.

#+begin_src tree
  <expr>                                <expr>
  ├──────┬────┐                         ├──────────────────┬────┐
  <expr> <op> <expr>                    <expr>             <op> <expr>
  │      │    ├──────┬────┐             ├──────┬────┐      │    │
  <var>  │    <expr> <op> <expr>        <expr> <op> <expr> │    <var>
  │      │    │      │    │             │      │    │      │    │
  │      │    <var>  │    <var>         <var>  │    <var>  │    │
  │      │    │      │    │             │      │    │      │    │
  x      +    x      +    x             x      +    x      +    x
#+end_src

These two parse trees correspond to the following two leftmost
derivations (the first for the tree on the left, the second for the
tree on the right).

#+begin_src deriv
<expr>
<expr> <op> <expr>
<var> <op> <expr>
x <op> <expr>
x + <expr>
x + <expr> <op> <expr>
x + <var> <op> <expr>
x + x <op> <expr>
x + x + <expr>
x + x + <var>
x + x + x

<expr>
<expr> <op> <expr>
<expr> <op> <expr> <op> <expr>
<var> <op> <expr> <op> <expr>
x <op> <expr> <op> <expr>
x + <expr> <op> <expr>
x + <var> <op> <expr>
x + x <op> <expr>
x + x + <expr>
x + x + <var>
x + x + x
#+end_src


This demonstrates that the above grammar is ambiguous.

#+begin_quote
*Aside.* In this example, and many of the examples we will see, it
will be fairly clear that the grammar is ambiguous.  As students of
computer science, we might think that we could write a /program/ that
checks for us if a grammar is ambiguous.  Unfortunately, this is
impossible (not just very difficult, but *impossible*).  This is to
say that determining if a context-free grammar is ambiguous is
*undecidable* (a term worth looking up if this piques your
interest).
#+end_quote

