Formal-Grammar/notes.html

<div id="outline-container-org92cc265" class="outline-2">
<h2 id="org92cc265">Ambiguity</h2>
<div class="outline-text-2" id="text-org92cc265">
<p>
As participants of language, we are no strangers to grammatical
ambiguity.  Take, for instance, the following sentence:<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-sent">John saw the man on the mountain with the telescope
</pre>
</div>

<p>
Was John using the telescope?  Was the man carrying the telescope?
Are the multiple mountains, one of which has a telescope on it?
</p>

<p>
The ambiguity exists because it is not clear <i>which</i> hierarchical
structure should scaffold the sentence.  Here's a possible parse
trees for the sentence.
</p>

<div class="org-src-container">
<pre class="src src-ascii">S
├────┐
NP   VP
│    ├───┬───────────────────────┐
N    V   NP                      PP
│    │   ├───────┐               │
│    │   NP      PP              │
│    │   │       ├──┐            ├────┐
│    │   │       P  NP           P    NP
│    │   ├───┐   │  ├───┐        │    ├───┐
│    │   A   N   │  A   N        │    A   N
│    │   │   │   │  │   │        │    │   │
John saw the man on the mountain with the telescope
</pre>
</div>

<p>
The propositional phrase <code>with the telescope</code> is grouped alongside the
verb phrase starting with <code>saw</code>, indicating that John was <i>using</i> the
telescope.  Another option:
</p>


<div class="org-src-container">
<pre class="src src-ascii">S
├────┐
NP   VP
│    ├───┐
N    V   NP
│    │   ├───────┐
│    │   NP      PP
│    │   ├───┐   ├──┐
│    │   A   N   P  NP
│    │   │   │   │  ├────────────┐
│    │   │   │   │  NP           PP
│    │   │   │   │  ├───┐        ├────┐
│    │   │   │   │  A   N        P    NP
│    │   │   │   │  │   │        │    ├───┐
│    │   │   │   │  │   │        │    A   N
│    │   │   │   │  │   │        │    │   │
John saw the man on the mountain with the telescope
</pre>
</div>

<p>
The prepositional phrase <code>with the telescope</code> is part of the noun
phrase with <code>the mountain</code>, indicating the there is a telescope on the
mountain and the man is climbing that mountain.
</p>

<p>
The ambiguity comes from not being completely sure which parse tree to
give to the sentence; we experience language in a <i>linear fashion</i>,
either by reading it or hearing it.  If our interlocutor could
<i>display</i> the parse tree of their statement (floating eerily in space
before your eyes) there would be nothing to say of (grammatical)
ambiguity.
</p>

<p>
But this is <i>not</i> how we experience language, or how we write
programs for that matter.  To drive the point home, there is a
natural-enough looking grammar which recognizes the above sentence.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">s</span>&gt;  <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">np</span>&gt; &lt;<span style="color: #483d8b;">vp</span>&gt;
&lt;<span style="color: #0000ff;">vp</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">v</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">v</span>&gt; &lt;<span style="color: #483d8b;">np</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">v</span>&gt; &lt;<span style="color: #483d8b;">np</span>&gt; &lt;<span style="color: #483d8b;">pp</span>&gt;
&lt;<span style="color: #0000ff;">pp</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">p</span>&gt; &lt;<span style="color: #483d8b;">np</span>&gt;
&lt;<span style="color: #0000ff;">np</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">n</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">d</span>&gt; &lt;<span style="color: #483d8b;">n</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">np</span>&gt; &lt;<span style="color: #483d8b;">pp</span>&gt;
&lt;<span style="color: #0000ff;">n</span>&gt;  <span style="color: #008b8b;">::=</span> John <span style="color: #ff0000; font-weight: bold;">|</span> man <span style="color: #ff0000; font-weight: bold;">|</span> mountain <span style="color: #ff0000; font-weight: bold;">|</span> telescope
&lt;<span style="color: #0000ff;">v</span>&gt;  <span style="color: #008b8b;">::=</span> saw
&lt;<span style="color: #0000ff;">d</span>&gt;  <span style="color: #008b8b;">::=</span> the
&lt;<span style="color: #0000ff;">p</span>&gt;  <span style="color: #008b8b;">::=</span> on <span style="color: #ff0000; font-weight: bold;">|</span> with
</pre>
</div>

<p>
The above sentence has multiple parse trees in the above
grammar. Equivalently, since parse trees correspond to exactly one
leftmost derivation (you should try to convince yourself of this), it
also has multiple leftmost derivations.
</p>

<blockquote>
<p>
<b>Exercise.</b> Give two leftmost derivations of
</p>

<div class="org-src-container">
<pre class="src src-sent">John saw the man on the mountain with the telescope
</pre>
</div>

<p>
in the above grammar.
</p>
</blockquote>

<p>
Ambiguity in natural language is a complex topic, but restricted to
formal grammars, ambiguity is a well-defined notion.
</p>

<blockquote>
<p>
<b>Definition.</b> A grammar is <b>ambiguous</b> there is a sentence it
recognizes which has two distinct parse trees.  Equivalently, it is
ambiguous of there is a sentence it recognizes which has two distinct
leftmost derivations.
</p>
</blockquote>

<p>
Thus, the above grammar is ambiguous in the mathematical sense.
</p>

<p>
More to the point, consider the following grammar which may be seen as
a prototype of a grammar for arithmetic expressions (something we will
probably want if we're to give a grammar for a programming language).
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">expr</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #0000ff;">op</span>&gt;   <span style="color: #008b8b;">::=</span> + <span style="color: #ff0000; font-weight: bold;">|</span> - <span style="color: #ff0000; font-weight: bold;">|</span> * <span style="color: #ff0000; font-weight: bold;">|</span> /
&lt;<span style="color: #0000ff;">var</span>&gt;  <span style="color: #008b8b;">::=</span> x
</pre>
</div>

<p>
This seems, ignoring obvious issues, a reasonable enough definition;
<i>an expression is either a variable or a pair of expressions with an
operator between them</i>.  Note that the recursive nature of the first
production rule means that this grammar recognizes an infinite number
of sentence.
</p>

<blockquote>
<p>
<b>Exercise.</b> Give a leftmost a derivation of <code>x * x + x * x</code> in the above grammar.
</p>
</blockquote>

<p>
But, with regards to ambiguity, we should already be suspicious of the
first production rule.  As soon as we've applied the (second
alternative of) the first production rule twice we have the partial derivation:
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
</pre>
</div>

<p>
For the third line, <i>which of the two <code>&lt;expr&gt;</code> symbols did we expand?</i>
To make this concrete, here are two parse trees for the sentence <code>x +
x + x</code>.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">expr</span>&gt;                                &lt;<span style="color: #483d8b;">expr</span>&gt;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9516;&#9472;&#9472;&#9472;&#9472;&#9488;                         &#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9516;&#9472;&#9472;&#9472;&#9472;&#9488;
&lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;                    &lt;<span style="color: #483d8b;">expr</span>&gt;             &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&#9474;      &#9474;    &#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9516;&#9472;&#9472;&#9472;&#9472;&#9488;             &#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9516;&#9472;&#9472;&#9472;&#9472;&#9488;      &#9474;    &#9474;
&lt;<span style="color: #483d8b;">var</span>&gt;  &#9474;    &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;        &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; &#9474;    &lt;<span style="color: #483d8b;">var</span>&gt;
&#9474;      &#9474;    &#9474;      &#9474;    &#9474;             &#9474;      &#9474;    &#9474;      &#9474;    &#9474;
&#9474;      &#9474;    &lt;<span style="color: #483d8b;">var</span>&gt;  &#9474;    &lt;<span style="color: #483d8b;">var</span>&gt;         &lt;<span style="color: #483d8b;">var</span>&gt;  &#9474;    &lt;<span style="color: #483d8b;">var</span>&gt;  &#9474;    &#9474;
&#9474;      &#9474;    &#9474;      &#9474;    &#9474;             &#9474;      &#9474;    &#9474;      &#9474;    &#9474;
x      +    x      +    x             x      +    x      +    x
</pre>
</div>

<p>
These two parse trees correspond to the following two leftmost
derivations (the first for the tree on the left, the second for the
tree on the right).
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #483d8b;">var</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x + &lt;<span style="color: #483d8b;">expr</span>&gt;
x + &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x + &lt;<span style="color: #483d8b;">var</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x + x &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x + x + &lt;<span style="color: #483d8b;">expr</span>&gt;
x + x + &lt;<span style="color: #483d8b;">var</span>&gt;
x + x + x

&lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #483d8b;">var</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x + &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x + &lt;<span style="color: #483d8b;">var</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x + x &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
x + x + &lt;<span style="color: #483d8b;">expr</span>&gt;
x + x + &lt;<span style="color: #483d8b;">var</span>&gt;
x + x + x
</pre>
</div>


<p>
This demonstrates that the above grammar is ambiguous.
</p>

<blockquote>
<p>
<b>Aside.</b> In this example, and many of the examples we will see, it
will be fairly clear that the grammar is ambiguous.  As students of
computer science, we might think that we could write a <i>program</i> that
checks for us if a grammar is ambiguous.  Unfortunately, this is
impossible (not just very difficult, but <b>impossible</b>).  This is to
say that determining if a context-free grammar is ambiguous is
<b>undecidable</b> (a term worth looking up if this piques your
interest).
</p>
</blockquote>
</div>
