Formal-Grammar/notes.org
** Avoiding Ambiguity

Our next task it to determine how to avoid this ambiguity, but first,
/why should we care?/ Natural language is ambiguous and we get along
perfectly fine.  Why should we go through this trouble to make sure
grammars we design are unambiguous?

It's a fair question; the way I see it, it's something of a promise
that we make to the user of a programming language that we **never
make unspoken assumptions about what a user meant when we read one of
their programs.** To be fair, we try to do this with natural language
too, but in communication, if a statement is ambiguous, we can usually
just ask our interlocutor what they meant.  We can't do this for a
program, so instead we make it /impossible/ for a sentence to have
multiple meanings.

#+begin_quote
*Aside.* We see a similar phenomena in legal language, which tends to
 be grammatically sterile, and usually no fun to read.
#+end_quote

*** (Reverse) Polish Notation

If our only concern is avoiding ambiguity, we can use *Polish
notation* or *reverse polish notation*.  In Polish notation, operators
appear *before* all their arguments, e.g.

~~~
<expr> ::= <var> | <op> <expr> <expr>
<op>   ::= + | - | * | /
<var>  ::= x
~~~

We won't dwell on this but it turns out this gives us an unambiguous
grammar, we don't even need parentheses.

It's not difficult to then guess what reverse polish notation is:
operators always appear *after* all their arguments.  This is how
early calculators like [[https://en.wikipedia.org/wiki/Hewlett-Packard_9100A][HP 9100A Desktop Calculator]] were designed.  If
you wanted to calculate something ~(2 + 3) * (4 - 5)~, you would
/push/ the values you want to apply operations to onto a *stack*, and
then apply operations to the top elements of the stack, like so:

#+begin_src rpn
STACK        RPN EXPRESSION
2            2
2 3          2 3
5            2 3 +
5 4          2 3 + 4
5 4 5        2 3 + 4 5
5 (-1)       2 3 + 4 5 -
(-5)         2 3 + 4 5 - *
#+end_src

So the sequence of tokens you end up typing into the calculator is an
expression in reverse polish notation.

#+begin_quote
*Exercise.* Derive the sentence

#+begin_src rpn
+ * x * x - x x x x
#+end_src

in the above grammar.
#+end_quote

The obvious issue with (reverse) polish notation is that it's
difficult to read.  Imagine working with a language in which
if-then-else logic had to be done like this:

#+begin_src prog
  IFTHENELSE
    cond
    IFTHENELSE
      IFTHENELSE
	cond
	ifcase
	elsecase
      ifcase
      elsecase
    elsecase
#+end_src

This is in part to say that what truly causes ambiguity in expressions
is complex operator *fixity*.

#+begin_quote
*Definition.* The *fixity* of an operator refers to where the
(syntactic components of an) operator is placed relative to its
arguments.  There are four kinds of operator fixity.
+ A *prefix* operator appears before its arguments. This is like
  function application in OCaml, e.g.,
  + ~f x~
  + ~not b~
+ A *postfix* operator appears after its arguments. This is like type
  constructor application in OCaml, e.g.,
  + ~int list~
  + ~bool option list~
+ An *infix* operator appears in between its arguments. This is like
  arithmetic operations we learn in primary school, e.g.,
  + ~2 + 3~
  + ~4 / 5~
+ A *mixfix* operator is an operator with multiple syntactic
  components which may appear as some combination of prefix, infix and
  postfix. This is like if-then-else expressions or anonymous
  functions in OCaml, e.g.,
  + ~if b then x else y~
  + ~fun x -> e~
#+end_quote

If we want to contend with operator fixity (i.e., we don't want *just*
prefix or *just* postfix operators, as in polish notation or reverse
polish notation) then we have to work to avoid ambiguity.

*** Parentheses

Another simple solution is to surround applications of operations with
parentheses:

#+begin_src bnf
<expr> ::= <var> | ( <expr> <op> <expr> )
<op>   ::= + | - | * | /
<var>  ::= x
#+end_src

It then becomes very clear in a derivation like

#+begin_src deriv
<expr>
( <expr> <op> <expr> )
( ( <expr> <op> <expr> ) <op> <expr> )
#+end_src

which ~<expr>~ in the second line we expanded.  But we run into a
similar issue: /lots of parentheses are no fun to read or type./

#+begin_quote
*Exercise.* Give a derivation of


#+begin_src sent
( ( ( x * x ) * x ) + ( x / x ) )
#+end_src

in the above grammar.
#+end_quote

#+begin_quote
*Aside.* The cult of parentheses is real.  Programming languages based
on [[https://en.wikipedia.org/wiki/Lisp_(programming_language)][LISP]] use full parenthesization /and/ prefix notation.  Many people
consider this to be elegant, and many others believe it to be ugly as
hell.
#+end_quote

So, our real basic question is: /how do we avoid grammar while being
able to mix operator fixities and not use so many parentheses?/ And
this question has a simple answer in theory: /make explicit
assumptions about how operator arguments are grouped./ This will mean
contending with two things: *associativity* and *precedence*.

