Formal-Grammar/notes.html

<div id="outline-container-orgc040f0f" class="outline-3">
<h3 id="orgc040f0f">Avoiding Ambiguity</h3>
<div class="outline-text-3" id="text-orgc040f0f">
<p>
Our next task it to determine how to avoid this ambiguity, but first,
<i>why should we care?</i> Natural language is ambiguous and we get along
perfectly fine.  Why should we go through this trouble to make sure
grammars we design are unambiguous?
</p>

<p>
It's a fair question; the way I see it, it's something of a promise
that we make to the user of a programming language that we <b><b>never
make unspoken assumptions about what a user meant when we read one of
their programs.</b></b> To be fair, we try to do this with natural language
too, but in communication, if a statement is ambiguous, we can usually
just ask our interlocutor what they meant.  We can't do this for a
program, so instead we make it <i>impossible</i> for a sentence to have
multiple meanings.
</p>

<blockquote>
<p>
<b>Aside.</b> We see a similar phenomena in legal language, which tends to
 be grammatically sterile, and usually no fun to read.
</p>
</blockquote>
</div>

<div id="outline-container-orgffbd23e" class="outline-4">
<h4 id="orgffbd23e">(Reverse) Polish Notation</h4>
<div class="outline-text-4" id="text-orgffbd23e">
<p>
If our only concern is avoiding ambiguity, we can use <b>Polish
notation</b> or <b>reverse polish notation</b>.  In Polish notation, operators
appear <b>before</b> all their arguments, e.g.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">expr</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #0000ff;">op</span>&gt;   <span style="color: #008b8b;">::=</span> + <span style="color: #ff0000; font-weight: bold;">|</span> - <span style="color: #ff0000; font-weight: bold;">|</span> * <span style="color: #ff0000; font-weight: bold;">|</span> /
&lt;<span style="color: #0000ff;">var</span>&gt;  <span style="color: #008b8b;">::=</span> x
</pre>
</div>

<p>
We won't dwell on this but it turns out this gives us an unambiguous
grammar, we don't even need parentheses.
</p>

<p>
It's not difficult to then guess what reverse polish notation is:
operators always appear <b>after</b> all their arguments.  This is how
early calculators like <a href="https://en.wikipedia.org/wiki/Hewlett-Packard_9100A">HP 9100A Desktop Calculator</a> were designed.  If
you wanted to calculate something <code>(2 + 3) * (4 - 5)</code>, you would
<i>push</i> the values you want to apply operations to onto a <b>stack</b>, and
then apply operations to the top elements of the stack, like so:
</p>

<div class="org-src-container">
<pre class="src src-rpn">STACK        RPN EXPRESSION
2            2
2 3          2 3
5            2 3 +
5 4          2 3 + 4
5 4 5        2 3 + 4 5
5 (-1)       2 3 + 4 5 -
(-5)         2 3 + 4 5 - *
</pre>
</div>

<p>
So the sequence of tokens you end up typing into the calculator is an
expression in reverse polish notation.
</p>

<blockquote>
<p>
<b>Exercise.</b> Derive the sentence
</p>

<div class="org-src-container">
<pre class="src src-rpn">+ * x * x - x x x x
</pre>
</div>

<p>
in the above grammar.
</p>
</blockquote>

<p>
The obvious issue with (reverse) polish notation is that it's
difficult to read.  Imagine working with a language in which
if-then-else logic had to be done like this:
</p>

<div class="org-src-container">
<pre class="src src-prog">IFTHENELSE
  cond
  IFTHENELSE
    IFTHENELSE
      cond
      ifcase
      elsecase
    ifcase
    elsecase
  elsecase
</pre>
</div>

<p>
This is in part to say that what truly causes ambiguity in expressions
is complex operator <b>fixity</b>.
</p>

<blockquote>
<p>
<b>Definition.</b> The <b>fixity</b> of an operator refers to where the
(syntactic components of an) operator is placed relative to its
arguments.  There are four kinds of operator fixity.
</p>
<ul class="org-ul">
<li>A <b>prefix</b> operator appears before its arguments. This is like
function application in OCaml, e.g.,
<ul class="org-ul">
<li><code>f x</code></li>
<li><code>not b</code></li>
</ul></li>
<li>A <b>postfix</b> operator appears after its arguments. This is like type
constructor application in OCaml, e.g.,
<ul class="org-ul">
<li><code>int list</code></li>
<li><code>bool option list</code></li>
</ul></li>
<li>An <b>infix</b> operator appears in between its arguments. This is like
arithmetic operations we learn in primary school, e.g.,
<ul class="org-ul">
<li><code>2 + 3</code></li>
<li><code>4 / 5</code></li>
</ul></li>
<li>A <b>mixfix</b> operator is an operator with multiple syntactic
components which may appear as some combination of prefix, infix and
postfix. This is like if-then-else expressions or anonymous
functions in OCaml, e.g.,
<ul class="org-ul">
<li><code>if b then x else y</code></li>
<li><code>fun x -&gt; e</code></li>
</ul></li>
</ul>
</blockquote>

<p>
If we want to contend with operator fixity (i.e., we don't want <b>just</b>
prefix or <b>just</b> postfix operators, as in polish notation or reverse
polish notation) then we have to work to avoid ambiguity.
</p>
</div>
</div>

<div id="outline-container-org236c5ea" class="outline-4">
<h4 id="org236c5ea">Parentheses</h4>
<div class="outline-text-4" id="text-org236c5ea">
<p>
Another simple solution is to surround applications of operations with
parentheses:
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">expr</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> ( &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; )
&lt;<span style="color: #0000ff;">op</span>&gt;   <span style="color: #008b8b;">::=</span> + <span style="color: #ff0000; font-weight: bold;">|</span> - <span style="color: #ff0000; font-weight: bold;">|</span> * <span style="color: #ff0000; font-weight: bold;">|</span> /
&lt;<span style="color: #0000ff;">var</span>&gt;  <span style="color: #008b8b;">::=</span> x
</pre>
</div>

<p>
It then becomes very clear in a derivation like
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #483d8b;">expr</span>&gt;
( &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; )
( ( &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; ) &lt;<span style="color: #483d8b;">op</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt; )
</pre>
</div>

<p>
which <code>&lt;expr&gt;</code> in the second line we expanded.  But we run into a
similar issue: <i>lots of parentheses are no fun to read or type.</i>
</p>

<blockquote>
<p>
<b>Exercise.</b> Give a derivation of
</p>


<div class="org-src-container">
<pre class="src src-sent">( ( ( x * x ) * x ) + ( x / x ) )
</pre>
</div>

<p>
in the above grammar.
</p>
</blockquote>

<blockquote>
<p>
<b>Aside.</b> The cult of parentheses is real.  Programming languages based
on <a href="https://en.wikipedia.org/wiki/Lisp_(programming_language)">LISP</a> use full parenthesization <i>and</i> prefix notation.  Many people
consider this to be elegant, and many others believe it to be ugly as
hell.
</p>
</blockquote>

<p>
So, our real basic question is: <i>how do we avoid grammar while being
able to mix operator fixities and not use so many parentheses?</i> And
this question has a simple answer in theory: <i>make explicit
assumptions about how operator arguments are grouped.</i> This will mean
contending with two things: <b>associativity</b> and <b>precedence</b>.
</p>
</div>
</div>
</div>
