Formal-Grammar/notes.org
** Associativity

Associativity refers to how arguments are grouped when we are given a
sequence of applications of an infix operator in the absence of
parentheses, e.g.,

#+begin_src sent
x + x + x + x
#+end_src

may be understood as any one of the following (among others):

#+begin_src sent
(((x + x) + x) + x)
(x + (x + (x + x)))
((x + x) + (x + x))
(x + ((x + x) + x))
#+end_src

#+begin_quote
*Exercise.* Determine the number of ways the expression

#+begin_src sent
x + x + x + x
#+end_src

can be parenthesized.
#+end_quote

In the case of addition this point is somewhat moot.  The order in
which we group arguments does not affect the /value/ of a sequence of
additions.  That is, addition is *associative*.

#+begin_quote
*Definition.* An operator $\circ: X \to X \to X$ is *associative* if

\begin{align*}
  (a \circ b) \circ c = a \circ (b \circ c)
\end{align*}

for any $a$, $b$, and $c$ in $X$.
#+end_quote

Not all operators are associative.  Take division for example.  We
need to /decide/ how to implicitly parenthesize an expression like

\begin{align*}
a / b / c / d
\end{align*}

Again, we could try to bar the ability to write an expression like
this, but we might rather avoid using parentheses if possible.

#+begin_quote
*Exercise.* How does OCaml evaluate the expression ~100 / 5 / 4~?
How are arguments grouped?
#+end_quote

For binary operators, we typically choose one of the first two choices
in the list of parenthesizations above.

#+begin_quote
*Definition.* A operation $\circ : X \to X \to X$ is said to be
*left-associative* if sequences of applications of the operator are
understood as grouping arguments from the left, i.e.,

\begin{align*}
a \circ b \circ c \circ d = (((a \circ b) \circ c) \circ d)
\end{align*}
for any $a$, $b$, $c$, and $d$, in $X$.  It's said to be
*right-associative* if arguments are grouped from the right, i.e.,

\begin{align*}
a \circ b \circ c \circ d = (a \circ (b \circ (c \circ d)))
\end{align*}
#+end_quote

#+begin_quote
*Remark.* Another option is that a binary operator can have no
associativity.  It does not, for instance, make sense to apply a
sequence of ~(=)~ operators in OCaml.
#+end_quote

Bringing this back to grammatical ambiguity, giving a parenthesization
of a sequence of operators means specifying a "shape" for the
corresponding parse tree.  For example, taking addition to be
left-associative, i.e., taking ~x + x + x~ to mean ~((x + x) + x)~,
implies that, of the two parse trees for this sentence in the above
image, the one on the right should be the "correct" one, /not/ the
one on the left.

#+begin_quote
*Example.* Another common ambiguous grammar in programming languages
is the one for function types.

#+begin_src bnf
<fun-type> ::= <int-type> | <fun-type> -> <fun-type>
<int-type> ::= int
#+end_src

#+end_quote

#+begin_quote
*Exercise.* Give two leftmost derivations of ~int -> int -> int~ in
 the above grammar.
#+end_quote

#+begin_quote
*Aside.* Looking ahead a bit, we will end up building parsers using a
parser generator.  In this setting, specifying the associativity of an
operator will be simple: there will be a command for doing so, a line
we'll add to the code.  But we can also deal with associativity /in
the grammar itself./

Function types are right associative, so we understand

#+begin_src ty
int -> int -> int
#+end_src

to be parenthesized implicitly as

#+begin_src ty
int -> (int -> int)
#+end_src

The problem, as it stands, is that because of the production rule

#+begin_src rule
<fun-type> ::= <fun-type> -> <fun-type>
#+end_src

the argument type can an arbitrary complex function type.  But we
might recognize that, no matter how deep the nesting, the argument
types have the special property in the case we assume right
associativity: /they're always just ~int~/.  Therefore, we
might consider the following updated grammar.

#+begin_src bnf
<fun-type> ::= <int-type> | <int-type> -> <fun-type>
<int-type> ::= int
#+end_src

In this grammar, no matter how many times you apply the second
alternative of the first production rule, the argument type is always
just the ~int~ type.  So we were, in fact, able to restrict the shape
of the parse tree for sentences, by *breaking the symmetry* the
production rule.  (This, of course, is more complicated once we start
considering higher-order functions).
#+end_quote

#+begin_quote
*Exercise.* Write the leftmost derivation of

#+begin_src ty
int -> int -> int
#+end_src

in the above grammar, along with its parse tree.
#+end_quote

