Formal-Grammar/notes.html

<div id="outline-container-orgc550ed5" class="outline-3">
<h3 id="orgc550ed5">Associativity</h3>
<div class="outline-text-3" id="text-orgc550ed5">
<p>
Associativity refers to how arguments are grouped when we are given a
sequence of applications of an infix operator in the absence of
parentheses, e.g.,
</p>

<div class="org-src-container">
<pre class="src src-sent">x + x + x + x
</pre>
</div>

<p>
may be understood as any one of the following (among others):
</p>

<div class="org-src-container">
<pre class="src src-sent">(((x + x) + x) + x)
(x + (x + (x + x)))
((x + x) + (x + x))
(x + ((x + x) + x))
</pre>
</div>

<blockquote>
<p>
<b>Exercise.</b> Determine the number of ways the expression
</p>

<div class="org-src-container">
<pre class="src src-sent">x + x + x + x
</pre>
</div>

<p>
can be parenthesized.
</p>
</blockquote>

<p>
In the case of addition this point is somewhat moot.  The order in
which we group arguments does not affect the <i>value</i> of a sequence of
additions.  That is, addition is <b>associative</b>.
</p>

<blockquote>
<p>
<b>Definition.</b> An operator \(\circ: X \to X \to X\) is <b>associative</b> if
</p>

\begin{align*}
  (a \circ b) \circ c = a \circ (b \circ c)
\end{align*}

<p>
for any \(a\), \(b\), and \(c\) in \(X\).
</p>
</blockquote>

<p>
Not all operators are associative.  Take division for example.  We
need to <i>decide</i> how to implicitly parenthesize an expression like
</p>

\begin{align*}
a / b / c / d
\end{align*}

<p>
Again, we could try to bar the ability to write an expression like
this, but we might rather avoid using parentheses if possible.
</p>

<blockquote>
<p>
<b>Exercise.</b> How does OCaml evaluate the expression <code>100 / 5 / 4</code>?
How are arguments grouped?
</p>
</blockquote>

<p>
For binary operators, we typically choose one of the first two choices
in the list of parenthesizations above.
</p>

<blockquote>
<p>
<b>Definition.</b> A operation \(\circ : X \to X \to X\) is said to be
<b>left-associative</b> if sequences of applications of the operator are
understood as grouping arguments from the left, i.e.,
</p>

\begin{align*}
a \circ b \circ c \circ d = (((a \circ b) \circ c) \circ d)
\end{align*}
<p>
for any \(a\), \(b\), \(c\), and \(d\), in \(X\).  It's said to be
<b>right-associative</b> if arguments are grouped from the right, i.e.,
</p>

\begin{align*}
a \circ b \circ c \circ d = (a \circ (b \circ (c \circ d)))
\end{align*}
</blockquote>

<blockquote>
<p>
<b>Remark.</b> Another option is that a binary operator can have no
associativity.  It does not, for instance, make sense to apply a
sequence of <code>(=)</code> operators in OCaml.
</p>
</blockquote>

<p>
Bringing this back to grammatical ambiguity, giving a parenthesization
of a sequence of operators means specifying a "shape" for the
corresponding parse tree.  For example, taking addition to be
left-associative, i.e., taking <code>x + x + x</code> to mean <code>((x + x) + x)</code>,
implies that, of the two parse trees for this sentence in the above
image, the one on the right should be the "correct" one, <i>not</i> the
one on the left.
</p>

<blockquote>
<p>
<b>Example.</b> Another common ambiguous grammar in programming languages
is the one for function types.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">fun-type</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">int-type</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">fun-type</span>&gt; -&gt; &lt;<span style="color: #483d8b;">fun-type</span>&gt;
&lt;<span style="color: #0000ff;">int-type</span>&gt; <span style="color: #008b8b;">::=</span> int
</pre>
</div>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> Give two leftmost derivations of <code>int -&gt; int -&gt; int</code> in
 the above grammar.
</p>
</blockquote>

<blockquote>
<p>
<b>Aside.</b> Looking ahead a bit, we will end up building parsers using a
parser generator.  In this setting, specifying the associativity of an
operator will be simple: there will be a command for doing so, a line
we'll add to the code.  But we can also deal with associativity <i>in
the grammar itself.</i>
</p>

<p>
Function types are right associative, so we understand
</p>

<div class="org-src-container">
<pre class="src src-ty">int -&gt; int -&gt; int
</pre>
</div>

<p>
to be parenthesized implicitly as
</p>

<div class="org-src-container">
<pre class="src src-ty">int -&gt; (int -&gt; int)
</pre>
</div>

<p>
The problem, as it stands, is that because of the production rule
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">fun-type</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">fun-type</span>&gt; -&gt; &lt;<span style="color: #483d8b;">fun-type</span>&gt;
</pre>
</div>

<p>
the argument type can an arbitrary complex function type.  But we
might recognize that, no matter how deep the nesting, the argument
types have the special property in the case we assume right
associativity: <i>they're always just <code>int</code></i>.  Therefore, we
might consider the following updated grammar.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">fun-type</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">int-type</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">int-type</span>&gt; -&gt; &lt;<span style="color: #483d8b;">fun-type</span>&gt;
&lt;<span style="color: #0000ff;">int-type</span>&gt; <span style="color: #008b8b;">::=</span> int
</pre>
</div>

<p>
In this grammar, no matter how many times you apply the second
alternative of the first production rule, the argument type is always
just the <code>int</code> type.  So we were, in fact, able to restrict the shape
of the parse tree for sentences, by <b>breaking the symmetry</b> the
production rule.  (This, of course, is more complicated once we start
considering higher-order functions).
</p>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> Write the leftmost derivation of
</p>

<div class="org-src-container">
<pre class="src src-ty">int -&gt; int -&gt; int
</pre>
</div>

<p>
in the above grammar, along with its parse tree.
</p>
</blockquote>
</div>
</div>
