Formal-Grammar/notes.org
** Precedence

In the examples from the previous section, there was only one operator.
In the presence of multiple operators we have new issues to deal with.
/How should something like $x * y + z$ be implicitly parenthesized?/

This is an issue of *precedence* or *order of operations* something
probably already somewhat familiar to you.

If you went through the American public school system then you
probably learned the abbreviation PEMDAS ((P)arentheses,
(E)xponentiation, (M)ultiplication, (D)ivision, (A)ddition,
(S)ubtraction, along with an accompanying mnemonic, something like
"please excuse my dear aunt sally").  Focusing on just the last four
letters, this rule tells us that we should group multiplications and
divisions first, and then group additions and subtractions.  That is
to say, multiplication and division have greater *precedence* than
addition and subtraction.

#+begin_quote
*Definition.* The *precedence* of an operator, relative to another
operator, determines which operator binds more tightly, in the
presents of ambiguity.
#+end_quote

#+begin_quote
*Example.* The expression $2 * 3 + 4 * 5$ should be implicitly
 parenthesized as $(2 * 3) + (4 * 5)$ because multiplication binds
 tighter, it is considered first.
#+end_quote


The relative precedence of a collection of operators determines the
"shape" of the parse tree we get when we generate the sentence with a
grammar.  To say that multiplication has higher precedence is to say
that when we build the parse tree for ~x * x + x~, we want ~+~ to be
the top-level operation, at the root of the tree.


#+begin_quote
*Remark.* One thing that was probably glossed over if/when you learned
PEMDAS: what do you do with something like $1 + 1 - 1 + 1$?  Do you
group additions and then subtractions? Or vice versa?  The issue here
is that addition and subtraction have the /same/ precedence.  In this
case, we will use the associativity of the operators to determine how
to parenthesize: **given a sequences of operators of the same
precedence, we use their associativity to group them.**

Since addition and subtraction are both left-associative, this would
be parenthesized as $((1 + 1) - 1) + 1$.  Things can get /truly/ ugly
if you have two operators with the same precedence, but /different/
associativity.  We will ignore this possibility in this course, but
this really matters in languages like Haskell, in which users can
define their own operators, with specified precedence and
associativity.
#+end_quote

All of this is to say: in order to define an unambiguous grammar
without parentheses, we need to know three things of each operator
appearing in the grammar: *fixity*, *associativity*, and *precedence*.
Fixity is determined directly by the production rules, but we will
have to specify associativity and precedence explicitly.

We can, for example, present the four basic arithmetic operators along
with this information.  The operators are presented in order of
decreasing precedence.[fn::We can only present the table like this
because we assume that all operators of the same precedence also have
the same fixity.]

| Operator | Fixity | Associativity |
|----------+--------+---------------+
| ~*~, ~/~ | infix  | left          |
| ~+~, ~-~ | infix  | left          |

In fact, just like the grammar for the OCaml is given in the OCaml
Manual, so is [[https://v2.ocaml.org/api/Ocaml_operators.html][the associativity and precedence of all its operators]].

#+begin_quote
*Aside.* As with associativity, we will be able to specify precedence
the parser generator we use.  And, as with associativity, we can also
deal with precedence in the grammar itself.

In the case of arithmetic expressions, we use similar observations:
+ because of associativity, the right argument of multiplication or division must be a variable ~x~;
+ because of precedence, the left argument of multiplication or division must contain only multiplications and divisions;
+ because of associativity, the right argument of addition or subtraction must be an expression with only multiplications and divisions.

These observations yields the following grammar.  I've tried to use
suggestive names to indicate how the three points above manifest.

#+begin_src bnf
<expr>         ::= <only-mul-div> | <expr> <add-sub> <only-mul-div>
<only-mul-div> ::= <var> | <only-mul-div> <mul-div> <var>
<add-sub>      ::= + | -
<mul-div>      ::= * | /
<var>          ::= x
#+end_src
#+end_quote

#+begin_quote
*Exercise.* Give the leftmost derivation of

#+begin_src sent
x * x + x * x
#+end_src

in the above grammar. Also draw its parse tree.
#+end_quote


Proving that this grammar is unambiguous is a bit tricky (we won't do
this).  It suffices to say that, given we know how to parenthesize
such expressions, and this grammar captures the rules we use, it would
seem to be ambiguous.

