Formal-Grammar/notes.html

<div id="outline-container-orgf000be4" class="outline-3">
<h3 id="orgf000be4">Precedence</h3>
<div class="outline-text-3" id="text-orgf000be4">
<p>
In the examples from the previous section, there was only one operator.
In the presence of multiple operators we have new issues to deal with.
<i>How should something like \(x * y + z\) be implicitly parenthesized?</i>
</p>

<p>
This is an issue of <b>precedence</b> or <b>order of operations</b> something
probably already somewhat familiar to you.
</p>

<p>
If you went through the American public school system then you
probably learned the abbreviation PEMDAS ((P)arentheses,
(E)xponentiation, (M)ultiplication, (D)ivision, (A)ddition,
(S)ubtraction, along with an accompanying mnemonic, something like
"please excuse my dear aunt sally").  Focusing on just the last four
letters, this rule tells us that we should group multiplications and
divisions first, and then group additions and subtractions.  That is
to say, multiplication and division have greater <b>precedence</b> than
addition and subtraction.
</p>

<blockquote>
<p>
<b>Definition.</b> The <b>precedence</b> of an operator, relative to another
operator, determines which operator binds more tightly, in the
presents of ambiguity.
</p>
</blockquote>

<blockquote>
<p>
<b>Example.</b> The expression \(2 * 3 + 4 * 5\) should be implicitly
 parenthesized as \((2 * 3) + (4 * 5)\) because multiplication binds
 tighter, it is considered first.
</p>
</blockquote>


<p>
The relative precedence of a collection of operators determines the
"shape" of the parse tree we get when we generate the sentence with a
grammar.  To say that multiplication has higher precedence is to say
that when we build the parse tree for <code>x * x + x</code>, we want <code>+</code> to be
the top-level operation, at the root of the tree.
</p>


<blockquote>
<p>
<b>Remark.</b> One thing that was probably glossed over if/when you learned
PEMDAS: what do you do with something like \(1 + 1 - 1 + 1\)?  Do you
group additions and then subtractions? Or vice versa?  The issue here
is that addition and subtraction have the <i>same</i> precedence.  In this
case, we will use the associativity of the operators to determine how
to parenthesize: <b><b>given a sequences of operators of the same
precedence, we use their associativity to group them.</b></b>
</p>

<p>
Since addition and subtraction are both left-associative, this would
be parenthesized as \(((1 + 1) - 1) + 1\).  Things can get <i>truly</i> ugly
if you have two operators with the same precedence, but <i>different</i>
associativity.  We will ignore this possibility in this course, but
this really matters in languages like Haskell, in which users can
define their own operators, with specified precedence and
associativity.
</p>
</blockquote>

<p>
All of this is to say: in order to define an unambiguous grammar
without parentheses, we need to know three things of each operator
appearing in the grammar: <b>fixity</b>, <b>associativity</b>, and <b>precedence</b>.
Fixity is determined directly by the production rules, but we will
have to specify associativity and precedence explicitly.
</p>

<p>
We can, for example, present the four basic arithmetic operators along
with this information.  The operators are presented in order of
decreasing precedence.<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Fixity</th>
<th scope="col" class="org-left">Associativity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>*</code>, <code>/</code></td>
<td class="org-left">infix</td>
<td class="org-left">left</td>
</tr>

<tr>
<td class="org-left"><code>+</code>, <code>-</code></td>
<td class="org-left">infix</td>
<td class="org-left">left</td>
</tr>
</tbody>
</table>

<p>
In fact, just like the grammar for the OCaml is given in the OCaml
Manual, so is <a href="https://v2.ocaml.org/api/Ocaml_operators.html">the associativity and precedence of all its operators</a>.
</p>

<blockquote>
<p>
<b>Aside.</b> As with associativity, we will be able to specify precedence
the parser generator we use.  And, as with associativity, we can also
deal with precedence in the grammar itself.
</p>

<p>
In the case of arithmetic expressions, we use similar observations:
</p>
<ul class="org-ul">
<li>because of associativity, the right argument of multiplication or
division must be a variable <code>x</code>;</li>
<li>because of precedence, the left argument of multiplication or
division must contain only multiplications and divisions;</li>
<li>because of associativity, the right argument of addition or
subtraction must be an expression with only multiplications and
divisions.</li>
</ul>

<p>
These observations yields the following grammar.  I've tried to use
suggestive names to indicate how the three points above manifest.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">expr</span>&gt;         <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">only-mul-div</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">add-sub</span>&gt; &lt;<span style="color: #483d8b;">only-mul-div</span>&gt;
&lt;<span style="color: #0000ff;">only-mul-div</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">only-mul-div</span>&gt; &lt;<span style="color: #483d8b;">mul-div</span>&gt; &lt;<span style="color: #483d8b;">var</span>&gt;
&lt;<span style="color: #0000ff;">add-sub</span>&gt;      <span style="color: #008b8b;">::=</span> + <span style="color: #ff0000; font-weight: bold;">|</span> -
&lt;<span style="color: #0000ff;">mul-div</span>&gt;      <span style="color: #008b8b;">::=</span> * <span style="color: #ff0000; font-weight: bold;">|</span> /
&lt;<span style="color: #0000ff;">var</span>&gt;          <span style="color: #008b8b;">::=</span> x
</pre>
</div>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> Give the leftmost derivation of
</p>

<div class="org-src-container">
<pre class="src src-sent">x * x + x * x
</pre>
</div>

<p>
in the above grammar. Also draw its parse tree.
</p>
</blockquote>


<p>
Proving that this grammar is unambiguous is a bit tricky (we won't do
this).  It suffices to say that, given we know how to parenthesize
such expressions, and this grammar captures the rules we use, it would
seem to be ambiguous.
</p>
</div>
</div>
