Formal-Grammar/notes.org
** Parentheses (Again)

We're not quite done.  Without parentheses, we can't derive all
expressions we might want to write down.  This is important:
*parentheses in a programming language aren't just "there"
implicitly.  We have to explicitly include them in our grammar.*

Given the rules we've described above, we cannot write an expression
(without parentheses) which is equivalent to

#+begin_src sent
(x + x) + x
#+end_src

To give a complete specification of the arithmetic expressions we know
and love, we have to add back parentheses (this is the "P" part of
PEMDAS).

But where should we put parentheses into the grammar?  As we saw
above, if we put them everywhere, we get unnecessarily verbose
sentences.  Rather, it should be the case that: /it should be possible
put *any* expression as an argument to operator if it's wrapped in
parentheses./ For this we will replace ~<var>~ with something can also
be any expression wrapped in parentheses.

#+begin_src bnf
<expr>          ::= <only-mul-div> | <expr> <add-sub> <only-mul-div>
<only-mul-div>  ::= <var-or-parens> | <only-mul-div> <mul-div> <var-or-parens>
<add-sub>       ::= + | -
<mul-div>       ::= * | /
<var-or-parens> ::= x | ( <expr> )
#+end_src

We might worry that now, it is again possible to have an arbitrary
expression as an argument to an operator, but the point is that, if we
do this, it must be wrapped in parentheses, which ensures unambiguity.

#+begin_quote
> *Exercise.* Give a leftmost derivation of

#+begin_src sent
( x + x ) * x
#+end_src

in the above grammar. Draw its parse tree.
#+end_quote


#+begin_quote
*Exercise.* (Challenge) According to PEMDAS, we also need to handle
exponentiation.  Give a grammar for arithmetic expressions including
parentheses and exponentiation, using the following operator
information.

| Operator | Fixity | Associativity |
|----------+--------+---------------|
| ~^~      | infix  | right         |
| ~*~, ~/~ | infix  | left          |
| ~+~, ~-~ | infix  | left          |
#+end_quote

#+begin_quote
*Exercise.* (Challenge) Write a grammar for Boolean expressions in Python.  You
can check what sorts of expressions are allowed by using the Python
interpreter.
#+end_quote

* Extended BNF

There are a number of extensions to the BNF (meta-)syntax which make
it more usable.  If you go digging around the Internet for Extended
BNF (EBNF), you'll find a couple definitions, most of which are more
complex than what we will choose to call EBNF here.  That said, the
extensions we consider in this short section are the ones that will be
available in the parser generator we use in the next chapter.

** Optional

We use ~[ SENT-FORM ]~ to notate part of a production rule which is
optional.  We may, for instance, want to write a language which has
both if-then and if-then-else expressions.  Rather than using the BNF
production rules

#+begin_src rule
  <if-expr> ::= if <expr> then <expr> | if <expr> then <expr> else <expr>
#+end_src

we can use the EBNF production rule

#+begin_src rule
  <if-expr> ::= if <expr> then <expr> [ else <expr> ]
#+end_src

These two rules express the same thing. In fact, /all BNF production
rules are also EBNF production rules, and all EBNF production rules
can be rewritten as a collection of BNF production rules./

#+begin_quote
*Exercise.* Rewrite the following EBNF production rule as a collection of BNF production rules.

#+begin_src rule
  <a> ::= a [ <b> ] [ a ]
#+end_src
#+end_quote

#+begin_quote
*Remark.* One issue with extending BNF is now we've made it harder to
express grammars which include the symbols used for the EBNF
extensions (e.g., ~[~ and ~]~).  In practice this is not a problem, we
will try to be very explicit if something like ~[~ appears as part of
a symbol of the grammar, and not a part of the specification of the
grammar.
#+end_quote

** Alternative

We use ~( SENT-FORM₁ | SENT-FORM₂ | ... | SENT-FORMₖ )~ to notate the
choice of multiple sentential forms as /part/ of a production rule.
In the previous section we defined a grammar for arithmetic
expressions with multiple rules for the choice of operation.

#+begin_src bnf
  <expr>          ::= <only-mul-div> | <expr> <add-sub> <only-mul-div>
  <only-mul-div>  ::= <var-or-parens> | <only-mul-div> <mul-div> <var-or-parens>
  <add-sub>       ::= + | -
  <mul-div>       ::= * | /
  <var-or-parens> ::= x | ( <expr> )
#+end_src

We can simplify this in EBNF by removing the production rules for operators.

#+begin_src bnf
  <expr>          ::= <only-mul-div> | <expr> (+ | -)  <only-mul-div>
  <only-mul-div>  ::= <var-or-parens> | <only-mul-div> (* | /) <var-or-parens>
  <var-or-parens> ::= x | ( <expr> )
#+end_src

