Formal-Grammar/notes.html

<div id="outline-container-org3348eb1" class="outline-3">
<h3 id="org3348eb1">Parentheses (Again)</h3>
<div class="outline-text-3" id="text-org3348eb1">
<p>
We're not quite done.  Without parentheses, we can't derive all
expressions we might want to write down.  This is important:
<b>parentheses in a programming language aren't just "there"
implicitly.  We have to explicitly include them in our grammar.</b>
</p>

<p>
Given the rules we've described above, we cannot write an expression
(without parentheses) which is equivalent to
</p>

<div class="org-src-container">
<pre class="src src-sent">(x + x) + x
</pre>
</div>

<p>
To give a complete specification of the arithmetic expressions we know
and love, we have to add back parentheses (this is the "P" part of
PEMDAS).
</p>

<p>
But where should we put parentheses into the grammar?  As we saw
above, if we put them everywhere, we get unnecessarily verbose
sentences.  Rather, it should be the case that: <i>it should be possible
put <b>any</b> expression as an argument to operator if it's wrapped in
parentheses.</i> For this we will replace <code>&lt;var&gt;</code> with something can also
be any expression wrapped in parentheses.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">expr</span>&gt;          <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">only-mul-div</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">add-sub</span>&gt; &lt;<span style="color: #483d8b;">only-mul-div</span>&gt;
&lt;<span style="color: #0000ff;">only-mul-div</span>&gt;  <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var-or-parens</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">only-mul-div</span>&gt; &lt;<span style="color: #483d8b;">mul-div</span>&gt; &lt;<span style="color: #483d8b;">var-or-parens</span>&gt;
&lt;<span style="color: #0000ff;">add-sub</span>&gt;       <span style="color: #008b8b;">::=</span> + <span style="color: #ff0000; font-weight: bold;">|</span> -
&lt;<span style="color: #0000ff;">mul-div</span>&gt;       <span style="color: #008b8b;">::=</span> * <span style="color: #ff0000; font-weight: bold;">|</span> /
&lt;<span style="color: #0000ff;">var-or-parens</span>&gt; <span style="color: #008b8b;">::=</span> x <span style="color: #ff0000; font-weight: bold;">|</span> ( &lt;<span style="color: #483d8b;">expr</span>&gt; )
</pre>
</div>

<p>
We might worry that now, it is again possible to have an arbitrary
expression as an argument to an operator, but the point is that, if we
do this, it must be wrapped in parentheses, which ensures unambiguity.
</p>

<blockquote>
<p>
&gt; <b>Exercise.</b> Give a leftmost derivation of
</p>

<div class="org-src-container">
<pre class="src src-sent">( x + x ) * x
</pre>
</div>

<p>
in the above grammar. Draw its parse tree.
</p>
</blockquote>


<blockquote>
<p>
<b>Exercise.</b> (Challenge) According to PEMDAS, we also need to handle
exponentiation.  Give a grammar for arithmetic expressions including
parentheses and exponentiation, using the following operator
information.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Fixity</th>
<th scope="col" class="org-left">Associativity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left">infix</td>
<td class="org-left">right</td>
</tr>

<tr>
<td class="org-left"><code>*</code>, <code>/</code></td>
<td class="org-left">infix</td>
<td class="org-left">left</td>
</tr>

<tr>
<td class="org-left"><code>+</code>, <code>-</code></td>
<td class="org-left">infix</td>
<td class="org-left">left</td>
</tr>
</tbody>
</table>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> (Challenge) Write a grammar for Boolean expressions in Python.  You
can check what sorts of expressions are allowed by using the Python
interpreter.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org9f37264" class="outline-2">
<h2 id="org9f37264">Extended BNF</h2>
<div class="outline-text-2" id="text-org9f37264">
<p>
There are a number of extensions to the BNF (meta-)syntax which make
it more usable.  If you go digging around the Internet for Extended
BNF (EBNF), you'll find a couple definitions, most of which are more
complex than what we will choose to call EBNF here.  That said, the
extensions we consider in this short section are the ones that will be
available in the parser generator we use in the next chapter.
</p>
</div>

<div id="outline-container-org3c33293" class="outline-3">
<h3 id="org3c33293">Optional</h3>
<div class="outline-text-3" id="text-org3c33293">
<p>
We use <code>[ SENT-FORM ]</code> to notate part of a production rule which is
optional.  We may, for instance, want to write a language which has
both if-then and if-then-else expressions.  Rather than using the BNF
production rules
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">if-expr</span>&gt; <span style="color: #008b8b;">::=</span> if &lt;<span style="color: #483d8b;">expr</span>&gt; then &lt;<span style="color: #483d8b;">expr</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> if &lt;<span style="color: #483d8b;">expr</span>&gt; then &lt;<span style="color: #483d8b;">expr</span>&gt; else &lt;<span style="color: #483d8b;">expr</span>&gt;
</pre>
</div>

<p>
we can use the EBNF production rule
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">if-expr</span>&gt; <span style="color: #008b8b;">::=</span> if &lt;<span style="color: #483d8b;">expr</span>&gt; then &lt;<span style="color: #483d8b;">expr</span>&gt; [ else &lt;<span style="color: #483d8b;">expr</span>&gt; ]
</pre>
</div>

<p>
These two rules express the same thing. In fact, <i>all BNF production
rules are also EBNF production rules, and all EBNF production rules
can be rewritten as a collection of BNF production rules.</i>
</p>

<blockquote>
<p>
<b>Exercise.</b> Rewrite the following EBNF production rule as a collection of BNF production rules.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">a</span>&gt; <span style="color: #008b8b;">::=</span> a [ &lt;<span style="color: #483d8b;">b</span>&gt; ] [ a ]
</pre>
</div>
</blockquote>

<blockquote>
<p>
<b>Remark.</b> One issue with extending BNF is now we've made it harder to
express grammars which include the symbols used for the EBNF
extensions (e.g., <code>[</code> and <code>]</code>).  In practice this is not a problem, we
will try to be very explicit if something like <code>[</code> appears as part of
a symbol of the grammar, and not a part of the specification of the
grammar.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgaf5667b" class="outline-3">
<h3 id="orgaf5667b">Alternative</h3>
<div class="outline-text-3" id="text-orgaf5667b">
<p>
We use <code>( SENT-FORM₁ | SENT-FORM₂ | ... | SENT-FORMₖ )</code> to notate the
choice of multiple sentential forms as <i>part</i> of a production rule.
In the previous section we defined a grammar for arithmetic
expressions with multiple rules for the choice of operation.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">expr</span>&gt;          <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">only-mul-div</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">add-sub</span>&gt; &lt;<span style="color: #483d8b;">only-mul-div</span>&gt;
&lt;<span style="color: #0000ff;">only-mul-div</span>&gt;  <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var-or-parens</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">only-mul-div</span>&gt; &lt;<span style="color: #483d8b;">mul-div</span>&gt; &lt;<span style="color: #483d8b;">var-or-parens</span>&gt;
&lt;<span style="color: #0000ff;">add-sub</span>&gt;       <span style="color: #008b8b;">::=</span> + <span style="color: #ff0000; font-weight: bold;">|</span> -
&lt;<span style="color: #0000ff;">mul-div</span>&gt;       <span style="color: #008b8b;">::=</span> * <span style="color: #ff0000; font-weight: bold;">|</span> /
&lt;<span style="color: #0000ff;">var-or-parens</span>&gt; <span style="color: #008b8b;">::=</span> x <span style="color: #ff0000; font-weight: bold;">|</span> ( &lt;<span style="color: #483d8b;">expr</span>&gt; )
</pre>
</div>

<p>
We can simplify this in EBNF by removing the production rules for operators.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">expr</span>&gt;          <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">only-mul-div</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt; (+ <span style="color: #ff0000; font-weight: bold;">|</span> -)  &lt;<span style="color: #483d8b;">only-mul-div</span>&gt;
&lt;<span style="color: #0000ff;">only-mul-div</span>&gt;  <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var-or-parens</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">only-mul-div</span>&gt; (* <span style="color: #ff0000; font-weight: bold;">|</span> /) &lt;<span style="color: #483d8b;">var-or-parens</span>&gt;
&lt;<span style="color: #0000ff;">var-or-parens</span>&gt; <span style="color: #008b8b;">::=</span> x <span style="color: #ff0000; font-weight: bold;">|</span> ( &lt;<span style="color: #483d8b;">expr</span>&gt; )
</pre>
</div>
</div>
</div>
